package language.python;

public class python {
    /**
     * 龟叔给Python的定位是“优雅”、“明确”、“简单”，所以Python程序看上去总是简单易懂，初学者学Python，不但入门容易，
     * 而且将来深入下去，可以编写那些非常非常复杂的程序。
     *
     * 第一个缺点就是运行速度慢，和C程序相比非常慢，因为Python是解释型语言，你的代码在执行时会一行一行地翻译成CPU能理解的机器码，
     * 这个翻译过程非常耗时，所以很慢。
     * 而C程序是运行前直接编译成CPU能执行的机器码，所以非常快。
     */

    /**
     * Python非常适合初学者用来进入计算机编程领域。Python属于非常高级的语言，掌握了这门高级语言，就对计算机编程的核心思想——抽象有了初步理解。
     * 如果希望继续深入学习计算机编程，可以学习Java、C、JavaScript、Lisp等不同类型的语言，只有多掌握不同领域的语言，有比较才更有收获。
     */

    /**
     * java是静态语言，定义变量时必须指定变量类型
     * python动态语言
     */

    /**
     * Python的整数没有大小限制，而某些语言的整数根据其存储长度是有大小限制的，例如Java对32位整数的范围限制在-2147483648-2147483647。
     */

    /**
     * 占位符 	替换内容
     %d 	整数
     %f 	浮点数
     %s 	字符串
     %x 	十六进制整数
     */
}
